---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTraySettings
source: html/99e3b914-6cf3-a0af-4c25-dc77048091f7.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySettings

The cable tray settings.

## Syntax (C#)
```csharp
public class CableTraySettings : Element
```